RAV38/SmartMonitorCOS/MIG/mig_gd32f103tb.c
/*
  Module Init Graph (MIG)
*/

#include "hdl_iface.h"

#define HDL_HXTAL_CLOCK              8000000
#define HDL_LXTAL_CLOCK              32768
#define HDL_HXTAL_2_PLLSEL_PREDIV    2
#define HDL_PLLMUL                   27
#define HDL_AHB_PREDIV               1
#define HDL_APB1_PREDIV              2
#define HDL_APB2_PREDIV              1
#define HDL_ADC_PREDIV               8
#define HDL_RTC_CLOCK                mod_clock_hxtal           /* Can be clocked by: mod_clock_hxtal, mod_clock_lxtal, mod_clock_irc40k. For mod_clock_hxtal applied prediv 2 */
#define HDL_PLL_SEL_CLOCK            mod_clock_hxtal           /* Can be clocked by: mod_clock_hxtal, mod_clock_irc8m. For mod_clock_irc8m applied prediv 2 */
#define HDL_SYS_CLOCK                mod_clock_pll             /* Can be clocked by: mod_clock_pll, mod_clock_irc8m, mod_clock_hxtal */
#define HDL_SYSTICK_COUNTER_RELOAD   108000 - 1                /* Clocked by AHB   */
#define HDL_I2C_SLAVE_ADDR           0x31

#define TIMER0_RELOAD_VAL            16000-1
#define TIMER1_RELOAD_VAL            16000-1

const hdl_module_base_t hdl_null_module = {
  .iface = NULL,
  .dependencies = NULL,
  .config = NULL,
  .mod_var = static_malloc(HDL_MODULE_VAR_SIZE)
};

#define HDL_INTERRUPT_PRIO_GROUP_BITS   __NVIC_PRIO_BITS

extern const void *_heap_start;
extern const void *_heap_size;

const hdl_mem_block_t hdl_heap_regions[] = {
  { &_heap_start, (uint32_t)&_heap_size },
  { NULL, 0 } /* Terminates the array. */  
};

const hdl_core_t mod_sys_core = {
  .iface = &hdl_core_arm_iface,
  .dependencies = NULL,
  .mod_var = static_malloc(HDL_MODULE_VAR_SIZE),
  .config = hdl_module_config(hdl_core_config_t, 
    .flash_latency = WS_WSCNT_2,
    .phy = SCB_BASE
  )
};

/**************************************************************
 *  NVIC, IRQ, EXTI
 *************************************************************/

hdl_interrupt_t mod_irq_systick = {
  .irq_cnf = hdl_module_config(hdl_interrupt_config_t,
    .irq_type = HDL_NVIC_EXCEPTION_SysTick,
    .priority = 0,
    .priority_group = 0
  )
};

hdl_interrupt_t mod_irq_timer0_up = {
  .irq_cnf = hdl_module_config(hdl_interrupt_config_t,
    .irq_type = HDL_NVIC_IRQ25_TIMER0_UP,
    .priority = 0,
    .priority_group = 0
  )
};

hdl_interrupt_t mod_irq_timer1 = {
  .irq_cnf = hdl_module_config(hdl_interrupt_config_t,
    .irq_type = HDL_NVIC_IRQ28_TIMER1,
    .priority = 0,
    .priority_group = 0
  )
};

hdl_interrupt_t mod_irq_adc0_1 = {
  .irq_cnf = hdl_module_config(hdl_interrupt_config_t,
    .irq_type = HDL_NVIC_IRQ18_ADC0_1,
    .priority = 0,
    .priority_group = 0
  )
};

hdl_interrupt_t mod_irq_i2c0_er = {
  .irq_cnf = hdl_module_config(hdl_interrupt_config_t,
    .irq_type = HDL_NVIC_IRQ32_I2C0_ER,
    .priority = 0,
    .priority_group = 0
  )
};

hdl_interrupt_t mod_irq_i2c0_ev = {
  .irq_cnf = hdl_module_config(hdl_interrupt_config_t,
    .irq_type = HDL_NVIC_IRQ31_I2C0_EV,
    .priority = 0,
    .priority_group = 0
  )
};

hdl_interrupt_t mod_irq_spi_0 = {
  .irq_cnf = hdl_module_config(hdl_interrupt_config_t,
    .irq_type = HDL_NVIC_IRQ35_SPI0,
    .priority = 0,
    .priority_group = 0
  )
};

hdl_interrupt_t mod_irq_usart0 = {
  .irq_cnf = hdl_module_config(hdl_interrupt_config_t,
    .irq_type = HDL_NVIC_IRQ37_USART0,
    .priority = 0,
    .priority_group = 0
  )
};

hdl_interrupt_t mod_irq_exti0 = {
  .irq_cnf = hdl_module_config(hdl_interrupt_config_t,
    .irq_type = HDL_NVIC_IRQ6_EXTI0,
    .priority = 0,
    .priority_group = 0
  )
};

hdl_interrupt_t mod_irq_exti1 = {
  .irq_cnf = hdl_module_config(hdl_interrupt_config_t,
    .irq_type = HDL_NVIC_IRQ7_EXTI1,
    .priority = 0,
    .priority_group = 0
  )
};

extern const hdl_nvic_config_t mod_nvic_cnf;

const void* const irq_vector[] __attribute__((aligned(HDL_VTOR_TAB_ALIGN))) = {
	&mod_nvic_cnf,
	&reset_handler,         /* Reset Handler */
	&nmi_handler,           /* NMI Handler */
	&hard_fault_handler,     /* Hard Fault Handler */
	&mem_manage_handler,     /* MPU Fault Handler */
	&bus_fault_handler,      /* Bus Fault Handler */
	&usage_fault_handler,    /* Usage Fault Handler */
	((void *)0),            /* Reserved */
	((void *)0),            /* Reserved */
	((void *)0),            /* Reserved */
	((void *)0),            /* Reserved */
	&svc_handler,           /* SVCall Handler */
	&debug_mon_handler,      /* Debug Monitor Handler */
	((void *)0),            /* Reserved */
	&pend_sv_handler,        /* PendSV Handler */
	&systick_handler,       /* SysTick Handler */

  &wwdgt_handler,                    /* IRQ0 */
  &lvd_handler,                      /* IRQ1 */
  &TAMPER_IRQHandler,                   /* IRQ2 */
  &rtc_handler,                      /* IRQ3 */
  &fmc_handler,                      /* IRQ4 */
  &rcu_handler,                      /* IRQ5 */
  &EXTI0_IRQHandler,                    /* IRQ6 */
  &EXTI1_IRQHandler,                    /* IRQ7 */
  &EXTI2_IRQHandler,                    /* IRQ8 */
  &EXTI3_IRQHandler,                    /* IRQ9 */
  &EXTI4_IRQHandler,                    /* IRQ10 */
  &DMA0_Channel0_IRQHandler,            /* IRQ11 */
  &DMA0_Channel1_IRQHandler,            /* IRQ12 */
  &DMA0_Channel2_IRQHandler,            /* IRQ13 */
  &DMA0_Channel3_IRQHandler,            /* IRQ14 */
  &DMA0_Channel4_IRQHandler,            /* IRQ15 */
  &DMA0_Channel5_IRQHandler,            /* IRQ16 */
  &DMA0_Channel6_IRQHandler,            /* IRQ17 */
  &ADC0_1_IRQHandler,                   /* IRQ18 */
#ifdef GD32F10X_MD
  &USBD_HP_CAN0_TX_IRQHandler,          /* IRQ19 */
  &USBD_LP_CAN0_RX0_IRQHandler,         /* IRQ20 */
  &CAN0_RX1_IRQHandler,                 /* IRQ21 */
  &CAN0_EWMC_IRQHandler,                /* IRQ22 */
  &EXTI5_9_IRQHandler,                  /* IRQ23 */
  &TIMER0_BRK_IRQHandler,               /* IRQ24 */
  &TIMER0_UP_IRQHandler,                /* IRQ25 */
  &TIMER0_TRG_CMT_IRQHandler,           /* IRQ26 */
  &timer0_channel_handler,           /* IRQ27 */
  &TIMER1_IRQHandler,                   /* IRQ28 */
  &timer2_handler,                   /* IRQ29 */
  &TIMER3_IRQHandler,                   /* IRQ30 */
  &i2c0_ev_handler,                  /* IRQ31 */
  &i2c0_er_handler,                  /* IRQ32 */
  &i2c1_ev_handler,                  /* IRQ33 */
  &i2c1_er_handler,                  /* IRQ34 */
  &spi0_handler,                     /* IRQ35 */
  &spi1_handler,                     /* IRQ36 */
  &usart0_handler,                   /* IRQ37 */
  &usart1_handler,                   /* IRQ38 */
  &USART2_IRQHandler,                   /* IRQ39 */
  &EXTI10_15_IRQHandler,                /* IRQ40 */
  &RTC_Alarm_IRQHandler,                /* IRQ41 */
  &USBD_WKUP_IRQHandler,                /* IRQ42 */
  &irq_n_handler,                       /* IRQ43 */
  &irq_n_handler,                       /* IRQ44 */
  &irq_n_handler,                       /* IRQ45 */
  &irq_n_handler,                       /* IRQ46 */
  &irq_n_handler,                       /* IRQ47 */
  &EXMC_IRQHandler,                     /* IRQ48 */
  &irq_n_handler,                       /* IRQ49 */
  &irq_n_handler,                       /* IRQ50 */
  &irq_n_handler,                       /* IRQ51 */
  &irq_n_handler,                       /* IRQ52 */
  &irq_n_handler,                       /* IRQ53 */
  &irq_n_handler,                       /* IRQ54 */
  &irq_n_handler,                       /* IRQ55 */
  &irq_n_handler,                       /* IRQ56 */
  &irq_n_handler,                       /* IRQ57 */
  &irq_n_handler,                       /* IRQ58 */
  &irq_n_handler,                       /* IRQ59 */
  &irq_n_handler,                       /* IRQ60 */
  &irq_n_handler,                       /* IRQ61 */
  &irq_n_handler,                       /* IRQ62 */
  &irq_n_handler,                       /* IRQ63 */
  &irq_n_handler,                       /* IRQ64 */
  &irq_n_handler,                       /* IRQ65 */
  &irq_n_handler,                       /* IRQ66 */
  &irq_n_handler,                       /* IRQ67 */
#endif /* GD32F10X_MD */
#ifdef GD32F10X_HD
  &USBD_HP_CAN0_TX_IRQHandler,          /* IRQ19 */
  &USBD_LP_CAN0_RX0_IRQHandler,         /* IRQ20 */
  &CAN0_RX1_IRQHandler,                 /* IRQ21 */
  &CAN0_EWMC_IRQHandler,                /* IRQ22 */
  &EXTI5_9_IRQHandler,                  /* IRQ23 */
  &TIMER0_BRK_IRQHandler,               /* IRQ24 */
  &TIMER0_UP_IRQHandler,                /* IRQ25 */
  &TIMER0_TRG_CMT_IRQHandler,           /* IRQ26 */
  &timer0_channel_handler,           /* IRQ27 */
  &TIMER1_IRQHandler,                   /* IRQ28 */
  &timer2_handler,                   /* IRQ29 */
  &TIMER3_IRQHandler,                   /* IRQ30 */
  &i2c0_ev_handler,                  /* IRQ31 */
  &i2c0_er_handler,                  /* IRQ32 */
  &i2c1_ev_handler,                  /* IRQ33 */
  &i2c1_er_handler,                  /* IRQ34 */
  &spi0_handler,                     /* IRQ35 */
  &spi1_handler,                     /* IRQ36 */
  &usart0_handler,                   /* IRQ37 */
  &usart1_handler,                   /* IRQ38 */
  &USART2_IRQHandler,                   /* IRQ39 */
  &EXTI10_15_IRQHandler,                /* IRQ40 */
  &RTC_Alarm_IRQHandler,                /* IRQ41 */
  &USBD_WKUP_IRQHandler,                /* IRQ42 */
  &TIMER7_BRK_IRQHandler,               /* IRQ43 */
  &TIMER7_UP_IRQHandler,                /* IRQ44 */
  &TIMER7_TRG_CMT_IRQHandler,           /* IRQ45 */
  &TIMER7_Channel_IRQHandler,           /* IRQ46 */
  &ADC2_IRQHandler,                     /* IRQ47 */
  &EXMC_IRQHandler,                     /* IRQ48 */
  &SDIO_IRQHandler,                     /* IRQ49 */
  &TIMER4_IRQHandler,                   /* IRQ50 */
  &SPI2_IRQHandler,                     /* IRQ51 */
  &UART3_IRQHandler,                    /* IRQ52 */
  &UART4_IRQHandler,                    /* IRQ53 */
  &timer5_handler,                   /* IRQ54 */
  &TIMER6_IRQHandler,                   /* IRQ55 */
  &DMA1_Channel0_IRQHandler,            /* IRQ56 */
  &DMA1_Channel1_IRQHandler,            /* IRQ57 */
  &DMA1_Channel2_IRQHandler,            /* IRQ58 */
  &DMA1_Channel3_4_IRQHandler,          /* IRQ59 */
  &irq_n_handler,                       /* IRQ60 */
  &irq_n_handler,                       /* IRQ61 */
  &irq_n_handler,                       /* IRQ62 */
  &irq_n_handler,                       /* IRQ63 */
  &irq_n_handler,                       /* IRQ64 */
  &irq_n_handler,                       /* IRQ65 */
  &irq_n_handler,                       /* IRQ66 */
  &irq_n_handler,                       /* IRQ67 */
#endif /* GD32F10X_HD */
#ifdef GD32F10X_XD
  &USBD_HP_CAN0_TX_IRQHandler,          /* IRQ19 */
  &USBD_LP_CAN0_RX0_IRQHandler,         /* IRQ20 */
  &CAN0_RX1_IRQHandler,                 /* IRQ21 */
  &CAN0_EWMC_IRQHandler,                /* IRQ22 */
  &EXTI5_9_IRQHandler,                  /* IRQ23 */
  &TIMER0_BRK_TIMER8_IRQHandler,        /* IRQ24 */
  &TIMER0_UP_TIMER9_IRQHandler,         /* IRQ25 */
  &TIMER0_TRG_CMT_TIMER10_IRQHandler,   /* IRQ26 */
  &timer0_channel_handler,           /* IRQ27 */
  &TIMER1_IRQHandler,                   /* IRQ28 */
  &timer2_handler,                   /* IRQ29 */
  &TIMER3_IRQHandler,                   /* IRQ30 */
  &i2c0_ev_handler,                  /* IRQ31 */
  &i2c0_er_handler,                  /* IRQ32 */
  &i2c1_ev_handler,                  /* IRQ33 */
  &i2c1_er_handler,                  /* IRQ34 */
  &spi0_handler,                     /* IRQ35 */
  &spi1_handler,                     /* IRQ36 */
  &usart0_handler,                   /* IRQ37 */
  &usart1_handler,                   /* IRQ38 */
  &USART2_IRQHandler,                   /* IRQ39 */
  &EXTI10_15_IRQHandler,                /* IRQ40 */
  &RTC_Alarm_IRQHandler,                /* IRQ41 */
  &USBD_WKUP_IRQHandler,                /* IRQ42 */
  &TIMER7_BRK_TIMER11_IRQHandler,       /* IRQ43 */
  &TIMER7_UP_TIMER12_IRQHandler,        /* IRQ44 */
  &TIMER7_TRG_CMT_TIMER13_IRQHandler,   /* IRQ45 */
  &TIMER7_Channel_IRQHandler,           /* IRQ46 */
  &ADC2_IRQHandler,                     /* IRQ47 */
  &EXMC_IRQHandler,                     /* IRQ48 */
  &SDIO_IRQHandler,                     /* IRQ49 */
  &TIMER4_IRQHandler,                   /* IRQ50 */
  &SPI2_IRQHandler,                     /* IRQ51 */
  &UART3_IRQHandler,                    /* IRQ52 */
  &UART4_IRQHandler,                    /* IRQ53 */
  &timer5_handler,                   /* IRQ54 */
  &TIMER6_IRQHandler,                   /* IRQ55 */
  &DMA1_Channel0_IRQHandler,            /* IRQ56 */
  &DMA1_Channel1_IRQHandler,            /* IRQ57 */
  &DMA1_Channel2_IRQHandler,            /* IRQ58 */
  &DMA1_Channel3_4_IRQHandler,          /* IRQ59 */
  &irq_n_handler,                       /* IRQ60 */
  &irq_n_handler,                       /* IRQ61 */
  &irq_n_handler,                       /* IRQ62 */
  &irq_n_handler,                       /* IRQ63 */
  &irq_n_handler,                       /* IRQ64 */
  &irq_n_handler,                       /* IRQ65 */
  &irq_n_handler,                       /* IRQ66 */
  &irq_n_handler,                       /* IRQ67 */
#endif /* GD32F10X_XD */
#ifdef GD32F10X_CL
  &CAN0_TX_IRQHandler,                  /* IRQ19 */
  &CAN0_RX0_IRQHandler,                 /* IRQ20 */
  &CAN0_RX1_IRQHandler,                 /* IRQ21 */
  &CAN0_EWMC_IRQHandler,                /* IRQ22 */
  &EXTI5_9_IRQHandler,                  /* IRQ23 */
  &TIMER0_BRK_IRQHandler,               /* IRQ24 */
  &TIMER0_UP_IRQHandler,                /* IRQ25 */
  &TIMER0_TRG_CMT_IRQHandler,           /* IRQ26 */
  &timer0_channel_handler,           /* IRQ27 */
  &TIMER1_IRQHandler,                   /* IRQ28 */
  &timer2_handler,                   /* IRQ29 */
  &TIMER3_IRQHandler,                   /* IRQ30 */
  &i2c0_ev_handler,                  /* IRQ31 */
  &i2c0_er_handler,                  /* IRQ32 */
  &i2c1_ev_handler,                  /* IRQ33 */
  &i2c1_er_handler,                  /* IRQ34 */
  &spi0_handler,                     /* IRQ35 */
  &spi1_handler,                     /* IRQ36 */
  &usart0_handler,                   /* IRQ37 */
  &usart1_handler,                   /* IRQ38 */
  &USART2_IRQHandler,                   /* IRQ39 */
  &EXTI10_15_IRQHandler,                /* IRQ40 */
  &RTC_Alarm_IRQHandler,                /* IRQ41 */
  &USBFS_WKUP_IRQHandler,               /* IRQ42 */
  &TIMER7_BRK_IRQHandler,               /* IRQ43 */
  &TIMER7_UP_IRQHandler,                /* IRQ44 */
  &TIMER7_TRG_CMT_IRQHandler,           /* IRQ45 */
  &TIMER7_Channel_IRQHandler,           /* IRQ46 */ 
  &irq_n_handler,                       /* IRQ47 */
  &EXMC_IRQHandler,                     /* IRQ48 */
  &irq_n_handler,                       /* IRQ49 */
  &TIMER4_IRQHandler,                   /* IRQ50 */
  &SPI2_IRQHandler,                     /* IRQ51 */
  &UART3_IRQHandler,                    /* IRQ52 */
  &UART4_IRQHandler,                    /* IRQ53 */
  &timer5_handler,                   /* IRQ54 */
  &TIMER6_IRQHandler,                   /* IRQ55 */
  &DMA1_Channel0_IRQHandler,            /* IRQ56 */
  &DMA1_Channel1_IRQHandler,            /* IRQ57 */
  &DMA1_Channel2_IRQHandler,            /* IRQ58 */
  &DMA1_Channel3_IRQHandler,            /* IRQ59 */
  &DMA1_Channel4_IRQHandler,            /* IRQ60 */
  &ENET_IRQHandler,                     /* IRQ61 */
  &ENET_WKUP_IRQHandler,                /* IRQ62 */
  &CAN1_TX_IRQHandler,                  /* IRQ63 */
  &CAN1_RX0_IRQHandler,                 /* IRQ64 */
  &CAN1_RX1_IRQHandler,                 /* IRQ65 */
  &CAN1_EWMC_IRQHandler,                /* IRQ66 */
  &USBFS_IRQHandler,                    /* IRQ67 */
#endif /* GD32F10X_CL */
  &irq_n_handler,                       /* IRQ68 */
  &irq_n_handler,                       /* IRQ69 */
  &irq_n_handler,                       /* IRQ70 */
  &irq_n_handler,                       /* IRQ71 */
  &irq_n_handler,                       /* IRQ72 */
  &irq_n_handler,                       /* IRQ73 */
  &irq_n_handler,                       /* IRQ74 */
  &irq_n_handler,                       /* IRQ75 */
  &irq_n_handler,                       /* IRQ76 */
  &irq_n_handler,                       /* IRQ77 */
  &irq_n_handler,                       /* IRQ78 */
  &irq_n_handler,                       /* IRQ79 */
};

