RAV38/SmartMonitorCOS/MIG/mig_gd32f103tb.c
const hdl_dma_channel_mcu_t mod_dma0_ch1 = { /* M2M */
  .iface = &hdl_dma_channel_iface,
  .dependencies = hdl_module_dependencies(&mod_dma0),
  .config = hdl_module_config(hdl_dma_channel_config_t,
    .priority = DMA_PRIORITY_LOW,
    .direction = DMA_PERIPHERAL_TO_MEMORY,
    .memory_width = DMA_MEMORY_WIDTH_32BIT,
    .periph_width = DMA_PERIPHERAL_WIDTH_32BIT,
    .memory_inc = 1,
    .periph_inc = 1,
    .m2m_direction = 1,
    .circular = 0
  ),
  .mod_var = static_malloc(HDL_MODULE_VAR_SIZE),
};

/**************************************************************
 *  GPIO
 *************************************************************/

const hdl_gpio_port_mcu_t hdl_gpio_port_a = {
  .iface = &hdl_gpio_port_iface,
  .dependencies = hdl_module_dependencies(&mod_clock_ahb),
  .config = hdl_module_config(hdl_gpio_port_config_t,
    .rcu = RCU_GPIOA,
    .phy = GPIOA
  ),
  .mod_var = static_malloc(HDL_MODULE_VAR_SIZE)
};

const hdl_gpio_port_mcu_t hdl_gpio_port_b = {
  .iface = &hdl_gpio_port_iface,
  .dependencies = hdl_module_dependencies(&mod_clock_ahb),
  .config = hdl_module_config(hdl_gpio_port_config_t,
    .rcu = RCU_GPIOB,
    .phy = GPIOB
  ),
  .mod_var = static_malloc(HDL_MODULE_VAR_SIZE)
};

const hdl_gpio_port_mcu_t hdl_gpio_port_c = {
  .iface = &hdl_gpio_port_iface,
  .dependencies = hdl_module_dependencies(&mod_clock_ahb),
  .config = hdl_module_config(hdl_gpio_port_config_t,
    .rcu = RCU_GPIOC,
    .phy = GPIOC
  ),
  .mod_var = static_malloc(HDL_MODULE_VAR_SIZE)
};

const hdl_gpio_port_mcu_t hdl_gpio_port_d = {
  .iface = &hdl_gpio_port_iface,
  .dependencies = hdl_module_dependencies(&mod_clock_ahb),
  .config = hdl_module_config(hdl_gpio_port_config_t,
    .rcu = RCU_GPIOD,
    .phy = GPIOD
  ),
  .mod_var = static_malloc(HDL_MODULE_VAR_SIZE)
};

const hdl_gpio_port_mcu_t hdl_gpio_port_e = {
  .iface = &hdl_gpio_port_iface,
  .dependencies = hdl_module_dependencies(&mod_clock_ahb),
  .config = hdl_module_config(hdl_gpio_port_config_t,
    .rcu = RCU_GPIOE,
    .phy = GPIOE
  ),
  .mod_var = static_malloc(HDL_MODULE_VAR_SIZE)
};

const hdl_gpio_port_mcu_t hdl_gpio_port_f = {
  .iface = &hdl_gpio_port_iface,
  .dependencies = hdl_module_dependencies(&mod_clock_ahb),
  .config = hdl_module_config(hdl_gpio_port_config_t,
    .rcu = RCU_GPIOF,
    .phy = GPIOF
  ),
  .mod_var = static_malloc(HDL_MODULE_VAR_SIZE)
};

const hdl_gpio_port_mcu_t hdl_gpio_port_g = {
  .iface = &hdl_gpio_port_iface,
  .dependencies = hdl_module_dependencies(&mod_clock_ahb),
  .config = hdl_module_config(hdl_gpio_port_config_t,
    .rcu = RCU_GPIOG,
    .phy = GPIOG
  ),
  .mod_var = static_malloc(HDL_MODULE_VAR_SIZE)
};

hdl_gpio_pin_hw_config_t mod_gpio_mode_output_pp = {
  .ospeed = GPIO_OSPEED_2MHZ,
  .type = GPIO_MODE_OUT_PP
};

hdl_gpio_pin_hw_config_t mod_gpio_mode_input_np = {
  .type = GPIO_MODE_IN_FLOATING
};

hdl_gpio_pin_hw_config_t mod_gpio_mode_input_pu = {
  .type = GPIO_MODE_IPU
};

hdl_gpio_pin_hw_config_t mod_gpio_mode_input_analog = {
  .type = GPIO_MODE_AIN
};

hdl_gpio_pin_hw_config_t mod_gpio_alternate_od_slow_mode = {
  .type = GPIO_MODE_AF_OD,
  .ospeed = GPIO_OSPEED_2MHZ
};

hdl_gpio_pin_hw_config_t mod_gpio_alternate_od_fast_mode = {
  .type = GPIO_MODE_AF_OD,
  .ospeed = GPIO_OSPEED_50MHZ
};

hdl_gpio_pin_hw_config_t mod_gpio_alternate_pp_fast_mode = {
  .type = GPIO_MODE_AF_PP,
  .ospeed = GPIO_OSPEED_50MHZ
};

hdl_gpio_pin_hw_config_t mod_gpio_alternate_pp_mid_mode = {
  .type = GPIO_MODE_AF_PP,
  .ospeed = GPIO_OSPEED_10MHZ
};

const hdl_exti_t exti0_cnf = {
  .line = HDL_EXTI_LINE_0,
  .mode = HDL_EXTI_MODE_INTERRUPT,
  .source = HDL_EXTI_SOURCE_PA,
  .trigger = HDL_EXTI_TRIGGER_FALLING
};

const hdl_exti_t exti1_cnf = {
  .line = HDL_EXTI_LINE_1,
  .mode = HDL_EXTI_MODE_INTERRUPT,
  .source = HDL_EXTI_SOURCE_PA,
  .trigger = HDL_EXTI_TRIGGER_FALLING
};

hdl_exti_controller_t mod_exti_controller = {
  .iface = &hdl_exti_controller_iface,
  .dependencies = hdl_module_dependencies(&mod_nvic),
  .mod_var = static_malloc(HDL_MODULE_VAR_SIZE),
  .config = hdl_module_config(hdl_exti_controller_config_t,
    .extis = hdl_extis(&exti0_cnf, &exti1_cnf),
    .phy = EXTI
  )
};

const hdl_gpio_pin_t mod_gpio_pa0 = {
  .iface = &hdl_gpio_pin_iface,
  .mod_var = static_malloc(HDL_MODULE_VAR_SIZE),
  .dependencies = hdl_module_dependencies(&hdl_gpio_port_a, &mod_exti_controller),
  .config = hdl_module_config(hdl_gpio_pin_config_t,
    .hwc = &mod_gpio_mode_input_pu,
    .inactive_default = HDL_GPIO_HIGH,
    .pin = GPIO_PIN_0)
}; //(PA0)

const hdl_gpio_pin_t mod_gpio_pa1 = {
  .iface = &hdl_gpio_pin_iface,
  .mod_var = static_malloc(HDL_MODULE_VAR_SIZE),
  .dependencies = hdl_module_dependencies(&hdl_gpio_port_a, &mod_exti_controller),
  .config = hdl_module_config(hdl_gpio_pin_config_t,
    .hwc = &mod_gpio_mode_input_pu,
    .inactive_default = HDL_GPIO_HIGH,
    .pin = GPIO_PIN_1)
}; //(PA1)

const hdl_gpio_pin_t mod_gpio_pa2 = {
  .iface = &hdl_gpio_pin_iface,
  .mod_var = static_malloc(HDL_MODULE_VAR_SIZE),
  .dependencies = hdl_module_dependencies(&hdl_gpio_port_a),
  .config = hdl_module_config(hdl_gpio_pin_config_t,
    .hwc = &mod_gpio_mode_output_pp, 
    .inactive_default = HDL_GPIO_LOW,
    .pin = GPIO_PIN_2)
}; //(PA2)

const hdl_gpio_pin_t mod_gpio_pa3 = {
  .iface = &hdl_gpio_pin_iface,
  .mod_var = static_malloc(HDL_MODULE_VAR_SIZE),
  .dependencies = hdl_module_dependencies(&hdl_gpio_port_a),
  .config = hdl_module_config(hdl_gpio_pin_config_t,
    .hwc = &mod_gpio_mode_input_analog, 
    .inactive_default = HDL_GPIO_LOW,
    .pin = GPIO_PIN_3)
}; //(PA3)

const hdl_gpio_pin_t mod_gpio_pa4_cs = {
  .iface = &hdl_gpio_pin_iface,
  .mod_var = static_malloc(HDL_MODULE_VAR_SIZE),
  .dependencies = hdl_module_dependencies(&hdl_gpio_port_a),
  .config = hdl_module_config(hdl_gpio_pin_config_t,
    .hwc = &mod_gpio_mode_output_pp,
    .inactive_default = HDL_GPIO_HIGH,
    .pin = GPIO_PIN_4)
}; //(PA4)

const hdl_gpio_pin_t mod_gpio_pa5_sck = {
  .iface = &hdl_gpio_pin_iface,
  .mod_var = static_malloc(HDL_MODULE_VAR_SIZE),
  .dependencies = hdl_module_dependencies(&hdl_gpio_port_a),
  .config = hdl_module_config(hdl_gpio_pin_config_t,
    .hwc = &mod_gpio_alternate_pp_fast_mode,
    .inactive_default = HDL_GPIO_LOW,
    .pin = GPIO_PIN_5)
}; //(PA5)

const hdl_gpio_pin_t mod_gpio_pa6_miso = {
  .iface = &hdl_gpio_pin_iface,
  .mod_var = static_malloc(HDL_MODULE_VAR_SIZE),
  .dependencies = hdl_module_dependencies(&hdl_gpio_port_a),
  .config = hdl_module_config(hdl_gpio_pin_config_t,
    .hwc = &mod_gpio_alternate_pp_fast_mode,
    .inactive_default = HDL_GPIO_LOW,
    .pin = GPIO_PIN_6)
}; //(PA6)

const hdl_gpio_pin_t mod_gpio_pa7_mosi = {
  .iface = &hdl_gpio_pin_iface,
  .mod_var = static_malloc(HDL_MODULE_VAR_SIZE),
  .dependencies = hdl_module_dependencies(&hdl_gpio_port_a),
  .config = hdl_module_config(hdl_gpio_pin_config_t,
    .hwc = &mod_gpio_alternate_pp_fast_mode,
    .inactive_default = HDL_GPIO_LOW,
    .pin = GPIO_PIN_7)
}; //(PA7)

