RAV38/SmartMonitorCOS/MIG/mig_gd32f103tb.c
const hdl_adc_config_t mod_adc0_cnf = {
  .phy = ADC0,
  .rcu = RCU_ADC0,
  .adc_interrupt = &mod_irq_adc0_1,
  .data_alignment = HDL_ADC_DATA_ALIGN_RIGHT,
  .init_timeout = 3000,
  .sources = hdl_adc_src(&mod_adc_source_3, &mod_adc_source_7),
};

const hdl_adc_mcu_t mod_adc0 = {
  .iface = &hdl_adc_iface,
  .dependencies = hdl_module_dependencies(&mod_clock_adc, &mod_systick_timer, &mod_dma0_ch0, &mod_nvic, &mod_gpio_pa3),
  .config = &mod_adc0_cnf,
  .mod_var = static_malloc(HDL_MODULE_VAR_SIZE),
  .obj_var = static_malloc(HDL_ADC_VAR_SIZE)
};

/**************************************************************
 *  UART
 *************************************************************/

 const hdl_uart_mcu_t mod_uart0 = {
  .iface = &hdl_uart_iface,
  .dependencies = hdl_module_dependencies(
    &mod_gpio_pa10_uart_rx,
    &mod_gpio_pa9_uart_tx,
    &mod_clock_apb2,
    &mod_nvic,
    &mod_systick_timer
  ),
  .config = hdl_module_config(hdl_uart_config_t,
    .phy = (uint32_t)USART0, 
    .rcu = RCU_USART0,
    .interrupt = &mod_irq_usart0,
    .baudrate = 115200,
    .word_len = USART_WL_8BIT,
    .parity = USART_PM_NONE,
    .stop_bits = USART_STB_1BIT
  ),
  .mod_var = static_malloc(HDL_MODULE_VAR_SIZE),
  .obj_var = static_malloc(HDL_UART_VAR_SIZE)
};

/**************************************************************
 *  EEPROM
 *************************************************************/

const hdl_eeprom_i2c_t mod_eeprom_m24M01 = {
  .iface = &hdl_eeprom_iface,
  .dependencies = hdl_module_dependencies(&mod_i2c0, &mod_systick_timer),
  .config = hdl_module_config(hdl_eeprom_i2c_config_t,
    .chip_address = 0x50,
    .page_size = 256,
    .write_time = 4,
    .size = 1024*128
  ),
  .mod_var = static_malloc(HDL_MODULE_VAR_SIZE),
  .obj_var = static_malloc(HDL_EEPROM_I2C_VAR_SIZE)
};

/*================================================================*/

extern const hdl_interrupt_controller_t mod_ic                     __attribute__ ((alias ("mod_nvic")));
extern const hdl_time_counter_t mod_timer_ms                       __attribute__ ((alias ("mod_systick_timer")));
extern const hdl_gpio_pin_t mod_sns_pwr_pin                        __attribute__ ((alias ("mod_gpio_pb5")));
extern const hdl_gpio_pin_t mod_acc_pwr_pin                        __attribute__ ((alias ("mod_gpio_pa2")));
extern const hdl_gpio_pin_t mod_acc_int1_pin                       __attribute__ ((alias ("mod_gpio_pa0")));
extern const hdl_gpio_pin_t mod_acc_int2_pin                       __attribute__ ((alias ("mod_gpio_pa1")));
extern const hdl_adc_t mod_adc                                     __attribute__ ((alias ("mod_adc0")));
extern hdl_interrupt_t acc_int1                                    __attribute__ ((alias ("mod_irq_exti0")));
extern hdl_interrupt_t acc_int2                                    __attribute__ ((alias ("mod_irq_exti1")));
const uint32_t adc_src_id_cur                                      = 0;
const uint32_t adc_src_id_volt                                     = 1;

extern const hdl_uart_t mod_uart                                   __attribute__ ((alias ("mod_uart0")));
extern const hdl_i2c_t mod_i2c                                     __attribute__ ((alias ("mod_i2c0")));
extern const hdl_nvm_t mod_storage                                 __attribute__ ((alias ("mod_eeprom_m24M01")));
